{
        "intents": [
                {
                        "tag": "powitanie",
                        "patterns": [
                                "Cześć",
                                "Witam",
                                "Dobry wieczór",
                                "Dzień dobry",
                                "Hej",
                                "Hejka",
                                "Hejo"
                        ],
                        "responses": [
                                "Hejka!",
                                "Witaj",
                                "Pozdrawiam",
                                "Witam serdecznie i gorąco"
                        ]
                },
                {
                        "tag": "pozegnanie",
                        "patterns": [
                                "Miłego dnia",
                                "Do widzenia",
                                "Żegnaj",
                                "Dobranoc",
                                "Papa",
                                "Pa"
                        ],
                        "responses": [
                                "Dobrego dnia",
                                "Zapraszam ponownie",
                                "Miło było Cię poznać"
                        ]
                },
                {
                        "tag": "brak",
                        "patterns": [
                                ""
                        ],
                        "responses": [
                                "Nie mogę Cię zrozumieć...",
                                "Powtórz proszę",
                                "Nie wiem o czym mówisz"
                        ]
                },
                {
                        "tag": "co_potrafisz",
                        "patterns": [
                                "potrafisz",
                                "możesz powiedzieć?",
                                "umiesz",
                                "wiesz"
                        ],
                        "responses": [
                                "Mogę podpowiedzieć Ci, w jaki sposób sformatować swoją pracę dyplomową. Możesz zapytać o układ pracy lub o formatowanie",
                                "Potrafię pomóc Ci z formatowaniem pracy dyplomowej. Możesz zapytać o układ pracy lub o formatowanie"
                        ]
                },
                {
                        "tag": "uklad",
                        "patterns": [
                                "układ pracy dyplomowej",
                                "układ pracy inżynierskiej",
                                "układ pracy",
                                "elementy pracy",
                                "zawartość pracy",
                                "składa",
                                "zawiera"
                        ],
                        "responses": [
                                "Praca dyplomowa składa się ze strony tytułowej, spisu treści, wykazu symboli, oznaczeń i skrótów, wstępu, dwóch rozdziałów tekstu zasadniczego, podsumowania i wniosków końcowych, załączników, wykazu literatury i streszczenia pracy. Zapytaj o jedną z części pracy, a podpowiem Ci, co powinno się w niej znaleźć"
                        ]
                },
                {
                        "tag": "tytulowa",
                        "patterns": [
                                "strona tytułowa",
                                "tytuł pracy",
                                "tytuł",
                                "pierwsza strona"
                        ],
                        "responses": [
                                "Pierwsza strona pracy dyplomowej musi być zgodna ze „Wzorem strony tytułowej”. Znajduje się on na stronie WWW Wydziału, w zakładce „Do pobrania”"
                        ]
                },
                {
                        "tag": "podziekowania",
                        "patterns": [
                                "podziękowania",
                                "podziękować"
                        ],
                        "responses": [
                                "Podziękowania dla osób, które przyczyniły się do powstania pracy można zamieścić na trzeciej stronie"
                        ]
                },
                {
                        "tag": "spis",
                        "patterns": [
                                "spis treści",
                                "spis"
                        ],
                        "responses": [
                                "Spis treści rozpoczyna się od strony numer 3 (lub 5, jeżeli zamieszczono podziękowania). Zajmuje jedną bądź dwie strony, w pełnej zgodności z rozkładem treści pracy"
                        ]
                },
                {
                        "tag": "symbole",
                        "patterns": [
                                "wykaz symboli",
                                "spis symboli",
                                "symbole",
                                "akronim",
                                "oznaczenia"
                        ],
                        "responses": [
                                "Zalecane jest umieszczenie wykazu użytych symboli, oznaczeń i akronimów po spisie treści, jeżeli jest to konieczne"
                        ]
                },
                {
                        "tag": "wstep",
                        "patterns": [
                                "wstep",
                                "wprowadzenie"
                        ],
                        "responses": [
                                "Wstęp zawiera od 1 do 5 stron z charakterystyką problematyki w świetle aktualnego stanu wiedzy i techniki, ze wskazaniem na zagadnienia istotne z punktu widzenia realizowanej pracy. Ostatni akapit wstępu musi zawierać zwięzłe sformułowanie celu i zakresu pracy."
                        ]
                },
                {
                        "tag": "tekst",
                        "patterns": [
                                "tekst zasadniczy",
                                "główna część pracy",
                                "treść pracy",
                                "główny tekst"
                        ],
                        "responses": [
                                "Pierwsza część tekstu zasadniczego zajmuje do 20% objętości pracy. W zależności od charakteru pracy ten rozdział powinien zawierać: opis tematyki zagadnienia (aktualny stan zagadnienia), metody i rozwiązania, dyskusję i krytyczną ocenę stanu aktualnego, podsumowanie stanu wiedzy, techniki, literaturowe. Druga część tekstu zasadniczego zajmuje onad 50% objętości pracy i jest częścią autorską. Zawiera ona: założenia i dane, opis zastosowanej metody rozwiązania lub analizy, opis proponowanego rozwiązania, wyniki analizy teoretycznej, obliczenia, projekt konstrukcyjny, procesowy, technologiczny,  wyniki badań analitycznych, symulacyjnych lub eksperymentalnych"
                        ]
                },
                {
                        "tag": "podsumowanie",
                        "patterns": [
                                "podsumowanie",
                                "wnioski końcowe",
                                "wnioski",
                                "koniec",
                                "zakończenie"
                        ],
                        "responses": [
                                "Podsumowanie powinno zajmować od 1 do 3 stron i merytorycznie podsumowywać najważniejsze elementy pracy oraz zawierać wnioski wynikające z osiągniętego celu pracy, jak również zaproponowane zalecenia i modyfikacje oraz rozwiązania będące wynikiem realizowanej pracy. Ostatni akapit podsumowania musi zawierać wykaz własnej pracy dyplomanta i zaczynać się od sformułowania: „Autor za własny wkład pracy uważa: …”."
                        ]
                },
                {
                        "tag": "zalaczniki",
                        "patterns": [
                                "załącznik",
                                "materiał źródłowy",
                                "program",
                                "katalog",
                                "kod źródłowy",
                                "kod"
                        ],
                        "responses": [
                                "Strona z załącznikami to uzupełnienie pracy o dowolny materiał źródłowy (wydruk programu komputerowego, dokumentacja konstrukcyjno-technologiczna, konstrukcja modelu – makiety – urządzenia, instrukcja obsługi urządzenia lub stanowiska laboratoryjnego, zestawienie wyników pomiarów i obliczeń, informacyjne materiały katalogowe)"
                        ]
                },
                {
                        "tag": "literatura",
                        "patterns": [
                                "literatura",
                                "książka",
                                "źródło",
                                "pozycje książkowe",
                                "wykaz literatury",
                                "źródła",
                                "książki"
                        ],
                        "responses": [
                                "W wykazie literatury zamieszcza się wyłącznie pozycje, na które powołano się w pracy. Wykaz literatury rozpoczyna od strony nieparzystej. Kolejność numerów w wykazie - zgodna z kolejnością pojawiania się danej pozycji w tekście. Format akapitu: akapit wyjustowany, wysunięcie 0,75 cm. Prawidłowo opracowany wykaz został zaprezentowany w szablonie pracy dyplomowej dostępnym na stronie WWW Wydziału, w zakładce „Do pobrania”"
                        ]
                },
                {
                        "tag": "streszczenie",
                        "patterns": [
                                "streszczenie",
                                "streścić",
                                "streść"
                        ],
                        "responses": [
                                "Streszczenie to 1 strona komunikatywnego opisu najistotniejszych zagadnień pracy w języku polskim i angielskim. Zawiera również słowa kluczowe. Prawidłowo opracowane streszczenie zostało zaprezentowane we wzorze streszczenia dostępnym na stronie WWW Wydziału, w zakładce „Do pobrania”"
                        ]
                },
                {
                        "tag": "format",
                        "patterns": [
                                "format",
                                "formatowanie"
                        ],
                        "responses": [
                                "Aby dowiedzieć się więcej o formatowaniu, możesz zapytać mnie o: formatowanie rozdziałów, formatowanie tekstu, odnośniki, rysunki i tabele, wzory matematyczne, numerowanie i punktowanie"
                        ]
                },
                {
                        "tag": "rozdziały",
                        "patterns": [
                                "rozdziały",
                                "formatowanie rozdziałów",
                                "format rozdziału"
                        ],
                        "responses": [
                                "Rozdziały zaczynają się u góry nowej strony (parzystej lub nieparzystej). Podrozdziały i zakresy mogą zaczynać się w dowolnym miejscu strony. Przy stosowaniu podziału na rozdziały i podrozdziały zaleca się unikać podziału więcej niż trzystopniowego. Podział tekstu, szczególnie na rozdziały główne, wynikać powinien z zakresu i charakterystyki realizowanej pracy. Należy pamiętać, że na końcu tytułu rozdziału, podrozdziału i zakresu nie umieszcza się kropki. Tytuł rozdziału – 16 pkt., tytuł podrozdziału – 14 pkt., tytuł zakresu – 12 pkt. Tytuły powinniy być pogrubione, z wysunięciem 1,25 cm"
                        ]
                },
                {
                        "tag": "czcionka",
                        "patterns": [
                                "format tekstu",
                                "formatowanie tekstu",
                                "tekst",
                                "czcionka"
                        ],
                        "responses": [
                                "Marginesy deklaruje się jako „lustrzane” i ustawia na 2 cm, na oprawę 1,5 cm. Nagłówek i stopka 1,25 cm. Tekst podstawowy akapitu: czcionka szeryfowa, styl Times (Times New Roman, Liberation Serif itp.), rozmiar 12 pkt., interlinia 1,5 wiersza. Akapit wyjustowany, wcięcie pierwszego wiersza 1,25 cm. Cytaty (dosłowne przytoczenie obcego tekstu w pracy) pisze się czcionką pochyłą (kursywą) i ujmuje w cudzysłów. Fragmenty kodów programów pisze się czcionką o stałej szerokości, styl Courier (Courier New, Liberation Mono itp.) o rozmiarze 10 punktów"
                        ]
                },
                {
                        "tag": "odnośniki",
                        "patterns": [
                                "odnośnik",
                                "cytat",
                                "przypis",
                                "odnośniki",
                                "cytaty",
                                "przypisy"
                        ],
                        "responses": [
                                "Na końcu każdego akapitu, którego tekst zaczerpnięto z literatury, musi znajdować się odnośnik do właściwej pozycji w wykazie literatury. W pracy nie stosuje się odnośników w formie przypisów. Liczby w nawiasie kwadratowym oznaczają kolejny numer pozycji w wykazie, np. [1] lub [1, 4, 7] lub [1, 6-8] itp."
                        ]
                },
                {
                        "tag": "rysunki",
                        "patterns": [
                                "rysunki",
                                "tabele",
                                "rysunek",
                                "tabela",
                                "rysunki tabele"
                        ],
                        "responses": [
                                "Tekst podstawowy w tabeli pisze się czcionką o rozmiarze 10 punktów, wyśrodkowany, pojedyncza interlinia. Rysunki i tabele zamieszcza się wyśrodkowane na stronie, bez wcięcia pierwszego wiersza. W akapicie poprzedzającym rysunek lub tabelę musi znajdować się krótki opis, czego dotyczy dany rysunek/tabela (odniesienie do rysunku/tabeli). Tytuły numeruje się zgodnie z kolejnością w danym rozdziale: numer_rozdziału.numer_tabeli/rysunku (np. rys. 2.1, tabela 3.5). W tytule rysunku/tabeli, zaczerpniętych z literatury, podaje się odnośnik do właściwej pozycji. Należy zadbać o to, aby opisy na rysunkach były czytelne (czcionka 8 punktów lub większa). "
                        ]
                },
                {
                        "tag": "wzory",
                        "patterns": [
                                "wzory",
                                "wzor",
                                "matematyczne",
                                "zmienne",
                                "równania"
                        ],
                        "responses": [
                                "Zmienne we wzorach pisze się czcionką pochyłą (styl edytora równań „Matematyka”) natomiast symbole, nie będące zmiennymi, czcionką prostą (styl „Tekst”). Rozmiary czcionek: normalny 12 punktów, indeks dolny/górny 9 pkt., indeks podrzędny 7 pkt., symbol 24 pkt., podsymbol 12 pkt. Separatorem dziesiętnym w liczbach jest przecinek a nie kropka (dotyczy to również liczb pisanych w tekście akapitu). Pod wzorem należy zamieścić objaśnienia użytych symboli (chyba, że znajdują się w wykazie na początku pracy). Wzory umieszcza się wyśrodkowane i numeruje zgodnie z kolejnością w danym rozdziale: (numer_rozdziału.numer_wzoru). Numery wzorów wyrównuje się do prawego marginesu. W akapicie poprzedzającym wzór musi znajdować się krótki opis, czego dotyczy dany wzór i – jeżeli potrzeba – odwołanie do literatury. "
                        ]
                },
                {
                        "tag": "numery",
                        "patterns": [
                                "numerowanie",
                                "punktowanie",
                                "numerowanie i punktowanie",
                                "numer",
                                "punkt"
                        ],
                        "responses": [
                                "W pierwszym poziomie stosuje się numerowanie lub punktowanie. Formatowanie: akapit wyjustowany, wcięcie od lewej 0,75 cm, wysunięcie co 0,5 cm. Znakiem numerowania jest liczba (z kropką lub nawiasem). W drugim poziomie stosuje się wyłącznie punktowanie. Formatowanie: akapit wyjustowany, wcięcie od lewej 1,25 cm, wysunięcie co 0,5 cm, znakiem punktowania jest łącznik lub mała litera alfabetu (z nawiasem). Nie zaleca się stosowania kropek, strzałek itp. Punktowane akapity rozpoczyna się minuskułą (małą literą), na końcu akapitu stawia się przecinek, ostatni punktowany akapit kończy się kropką. Numerowane akapity rozpoczyna się majuskułą (wielką literą) i kończy kropką."
                        ]
                }
        ]
}